const description = [
    {
        "專案名": "暮暮森",
        "圖片連結": "./assets/img/portfolio/w1/",
        "描述": "在每一個清晨安静地分享家的溫暖詩意， \n生活中極美的細節總是這樣令人陶醉。\n本案業主在忙碌的生活中想追求一個舒適明朗的家，\n以此消除疲憊感忘記喧囂，現代極簡風背後，\n體現的正是這種注重生活品味與健康時尚的生活態度♡",
        "區域": "林口",
        "日期": "2023",
        "坪數": "20",
        "種類": "住宅空間"
    },
    {
        "專案名": "暮與木",
        "圖片連結": "./assets/img/portfolio/w2/",
        "描述": "木色灰調宅，實木的香味圍繞在空間。 \n \n 溫暖的木色搭配沉靜的灰調，既有現代的簡約又有原木的溫馨，最符合家的調性輕鬆且自然♡",
        "區域": "天母",
        "日期": "2023",
        "坪數": "19",
        "種類": "住宅空間"
    },
    {
        "專案名": "非黑即白",
        "圖片連結": "./assets/img/portfolio/w3/",
        "描述": "少即是多，越簡單越能享受純粹。 \n 辦公室不僅僅是辦公場所，也是每天八小時的生活，注重交流，關注內心♡",
        "區域": "信義",
        "日期": "2023",
        "坪數": "19",
        "種類": "商業空間"
    },
    {
        "專案名": "藝文特區H宅",
        "圖片連結": "./assets/img/portfolio/w4/",
        "描述": "",
        "區域": "板橋",
        "日期": "2021",
        "坪數": "8",
        "種類": "概念/3D"
    },
    {
        "專案名": "中正K宅",
        "圖片連結": "./assets/img/portfolio/w5/",
        "描述": "",
        "區域": "基隆",
        "日期": "2022",
        "坪數": "16",
        "種類": "概念/3D"
    },
    {
        "專案名": "三重M宅",
        "圖片連結": "./assets/img/portfolio/w6/",
        "描述": "",
        "區域": "三重",
        "日期": "2023",
        "坪數": "20",
        "種類": "概念/3D"
    },
    {
        "專案名": "CASA‧T宅",
        "圖片連結": "./assets/img/portfolio/w7/",
        "描述": "",
        "區域": "信義",
        "日期": "2023",
        "坪數": "13",
        "種類": "概念/3D"
    },
    {
        "專案名": "辦公空間-工程管理",
        "圖片連結": "./assets/img/portfolio/w8/",
        "描述": "",
        "區域": "北投",
        "日期": "2023",
        "坪數": "53",
        "種類": "專案工程"
    },
    {
        "專案名": "廠房辦公室-工程管理",
        "圖片連結": "./assets/img/portfolio/w9/",
        "描述": "",
        "區域": "桃園",
        "日期": "2023",
        "坪數": "11",
        "種類": "專案工程"
    },
    {
        "專案名": "奶油可鹽",
        "圖片連結": "./assets/img/portfolio/w10/",
        "描述": "在這個以奶油色調為主的設計中，我們將溫馨柔和與現代俐落完美結合，營造出既舒適又時尚的氛圍。 \n\n 每一處細節都精心打磨，讓你在這個充滿格調的空間中，享受生活的美好與寧靜♡",
        "區域": "三重",
        "日期": "2024",
        "坪數": "20",
        "種類": "住宅空間"
    },
    {
        "專案名": "無色不樂",
        "圖片連結": "./assets/img/portfolio/w11/",
        "描述": "“灰色；高级不無聊，優雅的百搭王” \n\n 為這個空間增添了無盡的可能性，無論搭配哪種風格，總能帶來獨特的韻味及無限屬於您的魅力♡",
        "區域": "林口",
        "日期": "2024",
        "坪數": "14",
        "種類": "住宅空間"
    },
    {
        "專案名": "純粹之境",
        "圖片連結": "./assets/img/portfolio/w12/",
        "描述": "本空間蘊含了白色空間的純淨和無垠，讓人聯想到一個無需多餘修飾的世界， \n\n 憑藉純粹的設計語言去表達空間的靜謐與和諧♡",
        "區域": "板橋",
        "日期": "2024",
        "坪數": "13",
        "種類": "住宅空間"
    },
    {
        "專案名": "以寵之名",
        "圖片連結": "./assets/img/portfolio/w13/",
        "描述": "「寵物」是被寵、受寵的動物，是爸媽的心肝寶貝，是家人。 \n\n 全室以圓潤柔和的線條，守護毛孩跑跳探索中的安全。玄關滑門保留了通透感，增添毛孩探索的樂趣。溫暖的木質地板，讓毛孩可以隨時小憩。 \n\n 毛孩的一生與我們的日常交織，最多的愛獻給對人類毫無保留的毛孩♡♡♡",
        "區域": "信義",
        "日期": "2024",
        "坪數": "13",
        "種類": "住宅空間"
    },
  ];






// // 將 description 轉換為 JSON 字串後存儲到 localStorage 中
// description.sort((a, b) => {
//     return new Date(b.日期) - new Date(a.日期);
// });

localStorage.setItem('portfolio_description', JSON.stringify(description));