//將工作流程的敘述寫在這裡
const w_description = [
    {
        "服務名稱": "預售屋客變設計",
        "服務說明": {
                  "前期溝通": "填寫預約表單5個工作日內會與您聯繫，線上確認需求及初步介紹，預約公司會議提案日期",
                  "簽訂合約": "依據您的需求繪製多樣平面配置方案，與您細部討論需求調整方案",
                  "平面配置定案": "依照建商提供檔案，調整隔間圖、機電配置圖、燈具迴路圖、給排水配置圖等。完成後於會議與您討論確認",
                  "圖面確認": "協助與建商約定客變時間，陪同前往確認圖面及建材挑選，廚具設備確認等事項，完成預售屋客變",
                  "客變合約完成": "協助與建商確認追加減帳之內容符合客變需求",
                  "費用": "客變費用30坪(含)以下$40,000元、客變費用31坪(含)以上$60,000元",
                  "費用備註": "簽約後支付總價80%訂金，圖面及報價單完成後支付剩餘20%之尾款"
                  },
        "紅字備註": "**年末優惠方案，提案後三日內簽約享客變服務8折優惠;客變費用30坪(含)以下$32,000元;客變費用31坪(含)以上$48,000元"
    },
];


// 將 description 轉換為 JSON 字串後存儲到 localStorage 中
localStorage.setItem('workflow_description', JSON.stringify(w_description));